Tasks/ВыполнитьКорректировкуИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ВыполнитьКорректировкуИзделияКомплект</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылаКорректировка</Name>
					<Comment>0  данные не заполнены, 1 была, 2 не было</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроверкиГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/СостояниеЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗамера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗамера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строительный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Tasks/ВыполнитьКорректировкуИзделияКомплект/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ЗадачаПроверкиГабаритногоЧертежа) Тогда
	
		Элементы.Проект.ТолькоПросмотр 			= Истина;	
		Элементы.ИзделиеКомплект.ТолькоПросмотр = Истина;
		
		стДанныеЗадачиОснования = ПолучитьДанныеЗадачиОснования(Объект.ЗадачаПроверкиГабаритногоЧертежа);
		
		Если ПустаяСтрока(стДанныеЗадачиОснования.Комментарий) Тогда
			Элементы.КоментарийОснования.Видимость 		= Ложь;	
		Иначе
			КоментарийОснования = стДанныеЗадачиОснования.Комментарий
		КонецЕсли; 
		
		Если стДанныеЗадачиОснования.СтатусЗамера = Неопределено Тогда
			СостояниеГабаритногоЧертежа = "Состояние замера " + стДанныеЗадачиОснования.ГабаритныйЧертежНаименование + " неопределено."
		Иначе
			СостояниеГабаритногоЧертежа = "Состояние замера " + стДанныеЗадачиОснования.ГабаритныйЧертежНаименование + " " + стДанныеЗадачиОснования.СтатусЗамера + ".";
			Если стДанныеЗадачиОснования.СтатусЗамера = ПредопределенноеЗначение("Перечисление.СтатусыЗамера.Проектный") Тогда
				Элементы.СостояниеГабаритногоЧертежа.ЦветТекста	= Новый Цвет(255, 20, 30);	
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Элементы.КоментарийОснования.Видимость 			= Ложь;	
		Элементы.СостояниеГабаритногоЧертежа.Видимость 	= Ложь;	

	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеЗадачиОснования(ЗадачаПроверкиГабаритногоЧертежа)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроверитьГабаритныеЧертежи.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(СостояниеЗамераСрезПоследних.СтатусЗамера, НЕОПРЕДЕЛЕНО) КАК СтатусЗамера,
		|	ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование
		|ИЗ
		|	Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера.СрезПоследних КАК СостояниеЗамераСрезПоследних
		|		ПО (ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж = (ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектЗамера КАК Справочник.ГабаритныеЧертежи)))";
	
	Выборка = Запрос.Выполнить().Выбрать();

	стВозврата = Новый Структура("Комментарий, ГабаритныйЧертежНаименование, СтатусЗамера", "", "", Неопределено);
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;
	
    Возврат стВозврата;
КонецФункции // ПолучитьДанныеЗадачиОснования()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	Объект.Выполнена = Истина;
	Записать();
	Закрыть();
КонецПроцедуры
